{
  "welcome": "ยินดีต้อนรับ",
  "home": "หน้าแรก",
  "about": "ฉันคือใคร ?",
  "portfolio": "ผลงาน",
  "contact": "ติดต่อ",
  "click_to_dashboard": "คลิกเพื่อไปที่หน้าหลัก",
  "click": "คลิก",
  "scroll": "เลื่อนจอเพื่อไปต่อ",
  "hero-title": "Developer",
  "hero-subtitle": "สร้างประสบการณ์ผู้ใช้ที่น่าประทับใจ ด้วยเทคโนโลยีสมัยใหม่",
  "about-subtitle": "สวัสดีครับ ผมเป็นนักพัฒนาซอฟต์แวร์ที่ชื่นชอบการสร้างระบบที่มีประสิทธิภาพ ใช้งานง่าย และตอบโจทย์ผู้ใช้ เน้นทั้งฝั่ง Frontend และ Backend ด้วยเทคโนโลยี ที่ทันสมัย พร้อมเรียนรู้สิ่งใหม่ตลอดเวลา",
  "categories-all": "ทั้งหมด",
  "categories-1": "เว็บไซต์",
  "categories-2": "แลนดิ้งเพจ",
  "categories-3": "มือถือ",
  "contact-title": "ติดต่อฉัน",
  "contact-subtitle": "มีคำถามหรือต้องการร่วมงานกันใช่ไหม? กรอกแบบฟอร์มหรือส่งข้อความหาเราโดยตรงได้เลย",
  "form-name": "ชื่อ",
  "form-email": "อีเมล",
  "form-message": "ข้อความ",
  "form-message-sent": "ส่งข้อความ",
  "placeholder-name": "ชื่อของคุณ",
  "placeholder-email": "you@example.com",
  "placeholder-message": "พิมข้อความของคุณ...",
  "project1escription": "นี่คือเว็บแอป portfolio ชิ้นแรกของฉัน พัฒนาด้วย React JS โดยดึงดูดความสนใจด้วยเอฟเฟกต์ Tilt บนรูปภาพ และ Type-Animation สุดเท่บนส่วนที่เป็นข้อความ",
  "project2Description": "โปรเจกต์นี้เป็นเว็บแอปพลิเคชันเชิงจำลองสำหรับอีคอมเมิร์ซ ซึ่งนำเสนอความสามารถในการแสดงรายการสินค้าผ่านการเรียกใช้ API และมีฟังก์ชันการค้นหา เพื่ออำนวยความสะดวกในการเข้าถึงข้อมูลสินค้า",
  "project3Description": "โปรเจกต์นี้เป็นเว็บแอปพลิเคชันที่ถูกออกแบบมาพร้อมกับระบบการจัดการผู้ใช้ที่สมบูรณ์แบบ ซึ่งประกอบด้วยฟังก์ชันการลงทะเบียนและการเข้าสู่ระบบ โดยมีการใช้ Next.js เป็นโครงสร้างหลัก และผสานรวมกับ Next-Auth เพื่อจัดการการยืนยันตัวตน, bcryptjs เพื่อความปลอดภัยของข้อมูลรหัสผ่าน และ Mongoose สำหรับการเชื่อมต่อกับฐานข้อมูล",
  "project4Description": "นี่คือเว็บแอป portfolio ปัจจุบันที่รวบรวมประสบการณ์ทำงาน พร้อมฟังก์ชันการใช้งานที่ครบครัน เช่น การรองรับหลายภาษา (i18n), การจัดการสถานะด้วย Zustand, การออกแบบ UI ที่สวยงามด้วย DaisyUI, แอนิเมชันที่น่าสนใจจาก Framer Motion และระบบฟอร์มติดต่อที่เชื่อมต่อกับ Formspree",
  "project5Description": "นี่คือเว็บแอปพลิเคชันที่พัฒนาขึ้นเพื่อสกัดข้อความจากรูปภาพ โดยใช้ไลบรารี EasyOCR และภาษา Python สำหรับการประมวลผลฝั่งเซิร์ฟเวอร์ และนำผลลัพธ์มาแสดงผลบนหน้าเว็บไซต์ผ่านการเชื่อมต่อ API"
}
